Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D23.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>HSMC</name>
         <version>11036T</version>
         <description>Static Memory Controller</description>
         <groupName>SMC</groupName>
         <prependToName>SMC_</prependToName>
         <baseAddress>0xF8014000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x7EC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>HSMC</name>
            <value>17</value>
         </interrupt>
         <registers>
            <register>
               <name>HSMC_CFG</name>
               <description>NFC Configuration Register</description>
               <addressOffset>0x000</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PAGESIZE</name>
                     <description>Page Size of the NAND Flash Device</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PAGESIZESelect</name>
                        <enumeratedValue>
                           <name>PS512</name>
                           <description>Main area 512 bytes</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PS1024</name>
                           <description>Main area 1024 bytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PS2048</name>
                           <description>Main area 2048 bytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PS4096</name>
                           <description>Main area 4096 bytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PS8192</name>
                           <description>Main area 8192 bytes</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WSPARE</name>
                     <description>Write Spare Area</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSPARE</name>
                     <description>Read Spare Area</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EDGECTRL</name>
                     <description>Rising/Falling Edge Detection Control</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RBEDGE</name>
                     <description>Ready/Busy Signal Edge Detection</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTOCYC</name>
                     <description>Data Timeout Cycle Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DTOMUL</name>
                     <description>Data Timeout Multiplier</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>DTOMULSelect</name>
                        <enumeratedValue>
                           <name>X1</name>
                           <description>DTOCYC</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>X16</name>
                           <description>DTOCYC x 16</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>X128</name>
                           <description>DTOCYC x 128</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>X256</name>
                           <description>DTOCYC x 256</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>X1024</name>
                           <description>DTOCYC x 1024</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>X4096</name>
                           <description>DTOCYC x 4096</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>X65536</name>
                           <description>DTOCYC x 65536</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>X1048576</name>
                           <description>DTOCYC x 1048576</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NFCSPARESIZE</name>
                     <description>NAND Flash Spare Area Size Retrieved by the Host Controller</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_CTRL</name>
               <description>NFC Control Register</description>
               <addressOffset>0x004</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>NFCEN</name>
                     <description>NAND Flash Controller Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NFCDIS</name>
                     <description>NAND Flash Controller Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SR</name>
               <description>NFC Status Register</description>
               <addressOffset>0x008</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SMCSTS</name>
                     <description>NAND Flash Controller Status (this field cannot be reset)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RB_RISE</name>
                     <description>Selected Ready Busy Rising Edge Detected</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RB_FALL</name>
                     <description>Selected Ready Busy Falling Edge Detected</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NFCBUSY</name>
                     <description>NFC Busy (this field cannot be reset)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NFCWR</name>
                     <description>NFC Write/Read Operation (this field cannot be reset)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NFCSID</name>
                     <description>NFC Chip Select ID (this field cannot be reset)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>XFRDONE</name>
                     <description>NFC Data Transfer Terminated</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMDDONE</name>
                     <description>Command Done</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTOE</name>
                     <description>Data Timeout Error</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDEF</name>
                     <description>Undefined Area Error</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWB</name>
                     <description>Accessing While Busy</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NFCASE</name>
                     <description>NFC Access Size Error</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RB_EDGE0</name>
                     <description>Ready/Busy Line 0 Edge Detected</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_IER</name>
               <description>NFC Interrupt Enable Register</description>
               <addressOffset>0x00C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RB_RISE</name>
                     <description>Ready Busy Rising Edge Detection Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RB_FALL</name>
                     <description>Ready Busy Falling Edge Detection Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XFRDONE</name>
                     <description>Transfer Done Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMDDONE</name>
                     <description>Command Done Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTOE</name>
                     <description>Data Timeout Error Interrupt Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDEF</name>
                     <description>Undefined Area Access Interrupt Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWB</name>
                     <description>Accessing While Busy Interrupt Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NFCASE</name>
                     <description>NFC Access Size Error Interrupt Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RB_EDGE0</name>
                     <description>Ready/Busy Line 0 Interrupt Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_IDR</name>
               <description>NFC Interrupt Disable Register</description>
               <addressOffset>0x010</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RB_RISE</name>
                     <description>Ready Busy Rising Edge Detection Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RB_FALL</name>
                     <description>Ready Busy Falling Edge Detection Interrupt Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XFRDONE</name>
                     <description>Transfer Done Interrupt Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMDDONE</name>
                     <description>Command Done Interrupt Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTOE</name>
                     <description>Data Timeout Error Interrupt Disable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDEF</name>
                     <description>Undefined Area Access Interrupt Disable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWB</name>
                     <description>Accessing While Busy Interrupt Disable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NFCASE</name>
                     <description>NFC Access Size Error Interrupt Disable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RB_EDGE0</name>
                     <description>Ready/Busy Line 0 Interrupt Disable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_IMR</name>
               <description>NFC Interrupt Mask Register</description>
               <addressOffset>0x014</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RB_RISE</name>
                     <description>Ready Busy Rising Edge Detection Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RB_FALL</name>
                     <description>Ready Busy Falling Edge Detection Interrupt Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XFRDONE</name>
                     <description>Transfer Done Interrupt Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMDDONE</name>
                     <description>Command Done Interrupt Mask</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTOE</name>
                     <description>Data Timeout Error Interrupt Mask</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDEF</name>
                     <description>Undefined Area Access Interrupt Mask5</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWB</name>
                     <description>Accessing While Busy Interrupt Mask</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NFCASE</name>
                     <description>NFC Access Size Error Interrupt Mask</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RB_EDGE0</name>
                     <description>Ready/Busy Line 0 Interrupt Mask</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ADDR</name>
               <description>NFC Address Cycle Zero Register</description>
               <addressOffset>0x018</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR_CYCLE0</name>
                     <description>NAND Flash Array Address Cycle 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_BANK</name>
               <description>Bank Address Register</description>
               <addressOffset>0x01C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BANK</name>
                     <description>Bank Identifier</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
