Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D23.svd
            <register>
               <name>IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXCOMP</name>
                     <description>Transmission Completed Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXRDY</name>
                     <description>Receive Holding Register Ready Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmit Holding Register Ready Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SVACC</name>
                     <description>Slave Access Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GACC</name>
                     <description>General Call Access Interrupt Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Overrun Error Interrupt Mask</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNRE</name>
                     <description>Underrun Error Interrupt Mask</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NACK</name>
                     <description>Not Acknowledge Interrupt Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARBLST</name>
                     <description>Arbitration Lost Interrupt Mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCL_WS</name>
                     <description>Clock Wait State Interrupt Mask</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOSACC</name>
                     <description>End Of Slave Access Interrupt Mask</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCACK</name>
                     <description>Master Code Acknowledge Interrupt Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TOUT</name>
                     <description>Timeout Error Interrupt Mask</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PECERR</name>
                     <description>PEC Error Interrupt Mask</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMBDAM</name>
                     <description>SMBus Default Address Match Interrupt Mask</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMBHHM</name>
                     <description>SMBus Host Header Address Match Interrupt Mask</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RHR</name>
               <description>Receive Holding Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXDATA</name>
                     <description>Master or Slave Receive Holding Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RHR_FIFO_ENABLED_MODE</name>
               <description>Receive Holding Register</description>
               <alternateRegister>RHR</alternateRegister>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXDATA0</name>
                     <description>Master or Slave Receive Holding Data 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXDATA1</name>
                     <description>Master or Slave Receive Holding Data 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXDATA2</name>
                     <description>Master or Slave Receive Holding Data 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXDATA3</name>
                     <description>Master or Slave Receive Holding Data 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>THR</name>
               <description>Transmit Holding Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>Master or Slave Transmit Holding Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>THR_FIFO_ENABLED_MODE</name>
               <description>Transmit Holding Register</description>
               <alternateRegister>THR</alternateRegister>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXDATA0</name>
                     <description>Master or Slave Transmit Holding Data 02</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXDATA1</name>
                     <description>Master or Slave Transmit Holding Data 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXDATA2</name>
                     <description>Master or Slave Transmit Holding Data 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXDATA3</name>
                     <description>Master or Slave Transmit Holding Data 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMBTR</name>
               <description>SMBus Timing Register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRESC</name>
                     <description>SMBus Clock Prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TLOWS</name>
                     <description>Slave Clock Stretch Maximum Cycles</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TLOWM</name>
                     <description>Master Clock Stretch Maximum Cycles</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>THMAX</name>
                     <description>Clock High Maximum Cycles</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACR</name>
               <description>Alternative Command Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DATAL</name>
                     <description>Data Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DIR</name>
                     <description>Transfer Direction</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEC</name>
                     <description>PEC Request (SMBus Mode only)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NDATAL</name>
                     <description>Next Data Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NDIR</name>
                     <description>Next Transfer Direction</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NPEC</name>
                     <description>Next PEC Request (SMBus Mode only)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FILTR</name>
               <description>Filter Register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FILT</name>
                     <description>RX Digital Filter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PADFEN</name>
                     <description>PAD Filter Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PADFCFG</name>
                     <description>PAD Filter Config</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>THRES</name>
                     <description>Digital Filter Threshold</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWMR</name>
               <description>SleepWalking Matching Register</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SADR1</name>
                     <description>Slave Address 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SADR2</name>
                     <description>Slave Address 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SADR3</name>
                     <description>Slave Address 3</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>DATAM</name>
                     <description>Data Match</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FMR</name>
               <description>FIFO Mode Register</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXRDYM</name>
                     <description>Transmitter Ready Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TXRDYMSelect</name>
                        <enumeratedValue>
                           <name>ONE_DATA</name>
                           <description>TXRDY will be at level '1' when at least one data can be written in the Transmit FIFO</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO_DATA</name>
                           <description>TXRDY will be at level '1' when at least two data can be written in the Transmit FIFO</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FOUR_DATA</name>
                           <description>TXRDY will be at level '1' when at least four data can be written in the Transmit FIFO</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXRDYM</name>
                     <description>Receiver Ready Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>RXRDYMSelect</name>
                        <enumeratedValue>
                           <name>ONE_DATA</name>
                           <description>RXRDY will be at level '1' when at least one unread data is in the Receive FIFO</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO_DATA</name>
                           <description>RXRDY will be at level '1' when at least two unread data are in the Receive FIFO</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FOUR_DATA</name>
                           <description>RXRDY will be at level '1' when at least four unread data are in the Receive FIFO</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXFTHRES</name>
                     <description>Transmit FIFO Threshold</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXFTHRES</name>
                     <description>Receive FIFO Threshold</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLR</name>
               <description>FIFO Level Register</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXFL</name>
                     <description>Transmit FIFO Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXFL</name>
                     <description>Receive FIFO Level</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSR</name>
               <description>FIFO Status Register</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXFEF</name>
                     <description>Transmit FIFO Empty Flag (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFFF</name>
                     <description>Transmit FIFO Full Flag (cleared on read)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFTHF</name>
                     <description>Transmit FIFO Threshold Flag (cleared on read)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFEF</name>
                     <description>Receive FIFO Empty Flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFFF</name>
                     <description>Receive FIFO Full Flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFTHF</name>
                     <description>Receive FIFO Threshold Flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFPTEF</name>
                     <description>Transmit FIFO Pointer Error Flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFPTEF</name>
                     <description>Receive FIFO Pointer Error Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FIER</name>
               <description>FIFO Interrupt Enable Register</description>
               <addressOffset>0x64</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXFEF</name>
                     <description>TXFEF Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFFF</name>
                     <description>TXFFF Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFTHF</name>
                     <description>TXFTHF Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFEF</name>
                     <description>RXFEF Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFFF</name>
                     <description>RXFFF Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFTHF</name>
                     <description>RXFTHF Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFPTEF</name>
                     <description>TXFPTEF Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFPTEF</name>
                     <description>RXFPTEF Interrupt Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
