Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D23.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>XDMAC0</name>
         <version>11161M</version>
         <description>Extensible DMA Controller</description>
         <groupName>XDMAC</groupName>
         <prependToName>XDMAC_</prependToName>
         <baseAddress>0xF0010000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x8E8</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>XDMAC0</name>
            <value>6</value>
         </interrupt>
         <registers>
            <register>
               <name>GTYPE</name>
               <description>Global Type Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NB_CH</name>
                     <description>Number of Channels Minus One</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>FIFO_SZ</name>
                     <description>Number of Bytes</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>NB_REQ</name>
                     <description>Number of Peripheral Requests Minus One</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GCFG</name>
               <description>Global Configuration Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CGDISREG</name>
                     <description>Configuration Registers Clock Gating Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CGDISPIPE</name>
                     <description>Pipeline Clock Gating Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CGDISFIFO</name>
                     <description>FIFO Clock Gating Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CGDISIF</name>
                     <description>Bus Interface Clock Gating Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BXKBEN</name>
                     <description>Boundary X Kilobyte Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GWAC</name>
               <description>Global Weighted Arbiter Configuration Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PW0</name>
                     <description>Pool Weight 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PW1</name>
                     <description>Pool Weight 1</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PW2</name>
                     <description>Pool Weight 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PW3</name>
                     <description>Pool Weight 3</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GIE</name>
               <description>Global Interrupt Enable Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>IE0</name>
                     <description>XDMAC Channel 0 Interrupt Enable Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE1</name>
                     <description>XDMAC Channel 1 Interrupt Enable Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE2</name>
                     <description>XDMAC Channel 2 Interrupt Enable Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE3</name>
                     <description>XDMAC Channel 3 Interrupt Enable Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE4</name>
                     <description>XDMAC Channel 4 Interrupt Enable Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE5</name>
                     <description>XDMAC Channel 5 Interrupt Enable Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE6</name>
                     <description>XDMAC Channel 6 Interrupt Enable Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE7</name>
                     <description>XDMAC Channel 7 Interrupt Enable Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE8</name>
                     <description>XDMAC Channel 8 Interrupt Enable Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE9</name>
                     <description>XDMAC Channel 9 Interrupt Enable Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE10</name>
                     <description>XDMAC Channel 10 Interrupt Enable Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE11</name>
                     <description>XDMAC Channel 11 Interrupt Enable Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE12</name>
                     <description>XDMAC Channel 12 Interrupt Enable Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE13</name>
                     <description>XDMAC Channel 13 Interrupt Enable Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE14</name>
                     <description>XDMAC Channel 14 Interrupt Enable Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE15</name>
                     <description>XDMAC Channel 15 Interrupt Enable Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GID</name>
               <description>Global Interrupt Disable Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ID0</name>
                     <description>XDMAC Channel 0 Interrupt Disable Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID1</name>
                     <description>XDMAC Channel 1 Interrupt Disable Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID2</name>
                     <description>XDMAC Channel 2 Interrupt Disable Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID3</name>
                     <description>XDMAC Channel 3 Interrupt Disable Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID4</name>
                     <description>XDMAC Channel 4 Interrupt Disable Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID5</name>
                     <description>XDMAC Channel 5 Interrupt Disable Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID6</name>
                     <description>XDMAC Channel 6 Interrupt Disable Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID7</name>
                     <description>XDMAC Channel 7 Interrupt Disable Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID8</name>
                     <description>XDMAC Channel 8 Interrupt Disable Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID9</name>
                     <description>XDMAC Channel 9 Interrupt Disable Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID10</name>
                     <description>XDMAC Channel 10 Interrupt Disable Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID11</name>
                     <description>XDMAC Channel 11 Interrupt Disable Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID12</name>
                     <description>XDMAC Channel 12 Interrupt Disable Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID13</name>
                     <description>XDMAC Channel 13 Interrupt Disable Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID14</name>
                     <description>XDMAC Channel 14 Interrupt Disable Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID15</name>
                     <description>XDMAC Channel 15 Interrupt Disable Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GIM</name>
               <description>Global Interrupt Mask Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>IM0</name>
                     <description>XDMAC Channel 0 Interrupt Mask Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM1</name>
                     <description>XDMAC Channel 1 Interrupt Mask Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM2</name>
                     <description>XDMAC Channel 2 Interrupt Mask Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM3</name>
                     <description>XDMAC Channel 3 Interrupt Mask Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM4</name>
                     <description>XDMAC Channel 4 Interrupt Mask Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM5</name>
                     <description>XDMAC Channel 5 Interrupt Mask Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM6</name>
                     <description>XDMAC Channel 6 Interrupt Mask Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM7</name>
                     <description>XDMAC Channel 7 Interrupt Mask Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM8</name>
                     <description>XDMAC Channel 8 Interrupt Mask Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM9</name>
                     <description>XDMAC Channel 9 Interrupt Mask Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM10</name>
                     <description>XDMAC Channel 10 Interrupt Mask Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM11</name>
                     <description>XDMAC Channel 11 Interrupt Mask Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM12</name>
                     <description>XDMAC Channel 12 Interrupt Mask Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM13</name>
                     <description>XDMAC Channel 13 Interrupt Mask Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM14</name>
                     <description>XDMAC Channel 14 Interrupt Mask Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM15</name>
                     <description>XDMAC Channel 15 Interrupt Mask Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GIS</name>
               <description>Global Interrupt Status Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>IS0</name>
                     <description>XDMAC Channel 0 Interrupt Status Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS1</name>
                     <description>XDMAC Channel 1 Interrupt Status Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS2</name>
                     <description>XDMAC Channel 2 Interrupt Status Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS3</name>
                     <description>XDMAC Channel 3 Interrupt Status Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS4</name>
                     <description>XDMAC Channel 4 Interrupt Status Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS5</name>
                     <description>XDMAC Channel 5 Interrupt Status Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS6</name>
                     <description>XDMAC Channel 6 Interrupt Status Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS7</name>
                     <description>XDMAC Channel 7 Interrupt Status Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS8</name>
                     <description>XDMAC Channel 8 Interrupt Status Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS9</name>
                     <description>XDMAC Channel 9 Interrupt Status Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS10</name>
                     <description>XDMAC Channel 10 Interrupt Status Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS11</name>
                     <description>XDMAC Channel 11 Interrupt Status Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS12</name>
                     <description>XDMAC Channel 12 Interrupt Status Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS13</name>
                     <description>XDMAC Channel 13 Interrupt Status Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS14</name>
                     <description>XDMAC Channel 14 Interrupt Status Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS15</name>
                     <description>XDMAC Channel 15 Interrupt Status Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
